INSERT INTO authors (id, name)
VALUES ('e6237c14-9f46-4864-8d0c-96781141e937', 'Петров П.П.'),
       ('723d78ff-e7e2-4e29-9252-352d71d4628c', 'Иванов И.И.'),
       ('c7275318-a42d-4240-bc52-e2a45deff381', 'Новиков Н.Н.'),
       ('6281008a-2657-4a9f-b8d6-7156cf6e66fd', 'Григорьев Г.Г.');
INSERT INTO readers (id, name, library_card)
VALUES ('3d11e002-0142-4873-922a-7e79db262069', 'Волков И.П.', 33333),
       ('5fc47a06-df08-4f20-bbc1-00e960394c5e', 'Дугина В.А.', 44444),
       ('9f7ab521-a178-4c58-bbd8-b1070a73b462', 'Аюпов В.И.', 66666),
       ('be9f9e97-74bb-42c1-84cc-ea98cd53760c', 'Лукина М.П.', 88888),
       ('ba4a1d07-3a23-42f0-9799-3718ee2f0aa3', 'Хорин А.А.', 22222),
       ('3544c9bd-4fd4-4a64-ba82-0bba265af23c', 'Родин С.Г.', 99999),
       ('a020f6a7-462d-4cba-a753-70cea15e8f1d', 'Малышев П.С.', 11111),
       ('cda55e1c-22f5-4486-89ad-06009a11d5dd', 'Щепин В.П.', 55555),
       ('0930bef1-09ce-4389-8cdd-fbb588226159', 'Тюрина Ю.И.', 77777),
       ('8d517cf1-6ff7-475e-b7ea-a29510f04cc3', 'Ерохина О.Р.', 10101);
INSERT INTO books (id, name, reader_id, version)
VALUES ('3a21386e-767f-4ad5-8936-8ccc25476ce8', 'книга 1', '5fc47a06-df08-4f20-bbc1-00e960394c5e', 0), /*читает Дугина*/
       ('c348d084-3e6c-4110-9c51-8efa40aa28ea', 'книга 2', '9f7ab521-a178-4c58-bbd8-b1070a73b462', 0), /*читате Аюпов*/
       ('50476901-31e4-4157-bf92-b0adbc4f8d10', 'книга 3', '5fc47a06-df08-4f20-bbc1-00e960394c5e', 0), /*читает Дугина*/
       ('0a4ac56e-0a94-493a-8a2a-ead56bde1941', 'книга 4', 'a020f6a7-462d-4cba-a753-70cea15e8f1d', 0), /*читает Малышев*/
       ('179b231c-4df6-4e91-9c8e-6e26ca128f8b', 'книга 5', '5fc47a06-df08-4f20-bbc1-00e960394c5e', 0), /*читает Дугина*/
       ('ca4c36f5-46a8-4e6f-a709-f1731996e41d', 'книга 6', null, 0);
INSERT INTO books_authors (book_id, author_id)
/*книга 1 - новиков
  книга 2 - петров
  книга 3 - петров
  книга 3 - григорьев
  книга 4 - иванов
  книга 4 - петров
  книга 5 - григорьев
  книга 6 - иванов */
VALUES ('3a21386e-767f-4ad5-8936-8ccc25476ce8', 'c7275318-a42d-4240-bc52-e2a45deff381'),
       ('c348d084-3e6c-4110-9c51-8efa40aa28ea', 'e6237c14-9f46-4864-8d0c-96781141e937'),
       ('50476901-31e4-4157-bf92-b0adbc4f8d10', 'e6237c14-9f46-4864-8d0c-96781141e937'),
       ('50476901-31e4-4157-bf92-b0adbc4f8d10', '6281008a-2657-4a9f-b8d6-7156cf6e66fd'),
       ('0a4ac56e-0a94-493a-8a2a-ead56bde1941', '723d78ff-e7e2-4e29-9252-352d71d4628c'),
       ('0a4ac56e-0a94-493a-8a2a-ead56bde1941', 'e6237c14-9f46-4864-8d0c-96781141e937'),
       ('179b231c-4df6-4e91-9c8e-6e26ca128f8b', '6281008a-2657-4a9f-b8d6-7156cf6e66fd'),
       ('ca4c36f5-46a8-4e6f-a709-f1731996e41d', '723d78ff-e7e2-4e29-9252-352d71d4628c');
